#include "E_Lexicon.h"

void MainMenu()
{
    printf( "........................\n" );
    printf( "     欢迎使用生词库！     \n" );
    printf( "........................\n" );
    printf( "     1————创建生词库     \n" );
    printf( "     2————显示词库       \n" );
    printf( "     3————编辑词库       \n" );
    printf( "     4————查找生词       \n" );
    printf( "     5————更改密码       \n" );
    printf( "     0————退出系统       \n" );
    printf( "........................\n" );
    printf( "请选择选项编号（0-5）：" );
}

void ShowMenu()
{
    printf( "........................\n" );
    printf( "     欢迎使用生词库！     \n" );
    printf( "........................\n" );
    printf( "    1————显示所有单词    \n" );
    printf( "    2————显示中文单词    \n" );
    printf( "    3————显示英文单词    \n" );
    printf( "    4————返回           \n" );
    printf( "    0————退出系统        \n" );
    printf( "........................\n" );
    printf( "请选择选项编号（0-4）：" );
}

void EditMenu()
{
    printf( "........................\n" );
    printf( "     欢迎使用生词库！     \n" );
    printf( "........................\n" );
    printf( "      1————添加新词      \n" );
    printf( "      2————删除旧词      \n" );
    printf( "      3————修改旧词      \n" );
    printf( "      4————返回          \n" );
    printf( "      0————退出系统      \n" );
    printf( "........................\n" );
    printf( "请选择选项编号（0-4）：" );
}

void FindMenu()
{
    printf( "........................\n" );
    printf( "     欢迎使用生词库！     \n" );
    printf( "........................\n" );
    printf( "    1————用英文查找生词  \n" );
    printf( "    2————用中文查找生词  \n" );
    printf( "    3————返回           \n" );
    printf( "    0————退出系统        \n" );
    printf( "........................\n" );
    printf( "请选择选项编号（0-3）：" );
}